Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_exti.h
/*
; stm32V873_exti.
; ===============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32V873_exti equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// EXTI address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    RTSR1;
    volatile    uint32_t    FTSR1;
    volatile    uint32_t    SWIER1;
    volatile    uint32_t    RPR1;
    volatile    uint32_t    FPR1;
    volatile    uint32_t    SECCFGR1;
    volatile    uint32_t    PRIVCFGR1;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    RTSR2;
    volatile    uint32_t    FTSR2;
    volatile    uint32_t    SWIER2;
    volatile    uint32_t    RPR2;
    volatile    uint32_t    FPR2;
    volatile    uint32_t    SECCFGR2;
    volatile    uint32_t    PRIVCFGR2;
    volatile    uint32_t    RESERVED1[6];
    volatile    uint32_t    SECCFGR3;
    volatile    uint32_t    PRIVCFGR3;
    volatile    uint32_t    RESERVED2;
    volatile    uint32_t    EXTICR1;
    volatile    uint32_t    EXTICR2;
    volatile    uint32_t    EXTICR3;
    volatile    uint32_t    EXTICR4;
    volatile    uint32_t    LOCKR;
    volatile    uint32_t    RESERVED3[3];
    volatile    uint32_t    IMR1;
    volatile    uint32_t    EMR1;
    volatile    uint32_t    RESERVED4[2];
    volatile    uint32_t    IMR2;
    volatile    uint32_t    EMR2;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    IMR3;
    volatile    uint32_t    EMR3;
} EXTI_TypeDef;

#if (defined(__cplusplus))
#define EXTI_NS     reinterpret_cast<EXTI_TypeDef *>(0x46025000u)
#define EXTI_S      reinterpret_cast<EXTI_TypeDef *>(0x56025000u)

#else
#define EXTI_NS     ((EXTI_TypeDef *)0x46025000u)
#define EXTI_S      ((EXTI_TypeDef *)0x56025000u)
#endif

// RTSR1 Configuration

#define EXTI_RTSR1_RT21                 (0x1u<<21)
#define EXTI_RTSR1_RT20                 (0x1u<<20)
#define EXTI_RTSR1_RT16                 (0x1u<<16)
#define EXTI_RTSR1_RT15                 (0x1u<<15)
#define EXTI_RTSR1_RT14                 (0x1u<<14)
#define EXTI_RTSR1_RT13                 (0x1u<<13)
#define EXTI_RTSR1_RT12                 (0x1u<<12)
#define EXTI_RTSR1_RT11                 (0x1u<<11)
#define EXTI_RTSR1_RT10                 (0x1u<<10)
#define EXTI_RTSR1_RT9                  (0x1u<<9)
#define EXTI_RTSR1_RT8                  (0x1u<<8)
#define EXTI_RTSR1_RT7                  (0x1u<<7)
#define EXTI_RTSR1_RT6                  (0x1u<<6)
#define EXTI_RTSR1_RT5                  (0x1u<<5)
#define EXTI_RTSR1_RT4                  (0x1u<<4)
#define EXTI_RTSR1_RT3                  (0x1u<<3)
#define EXTI_RTSR1_RT2                  (0x1u<<2)
#define EXTI_RTSR1_RT1                  (0x1u<<1)
#define EXTI_RTSR1_RT0                  (0x1u<<0)

#define EXTI_RTSR1_RT21_B_0X0           (0x0u<<21)
#define EXTI_RTSR1_RT21_B_0X1           (0x1u<<21)
#define EXTI_RTSR1_RT20_B_0X0           (0x0u<<20)
#define EXTI_RTSR1_RT20_B_0X1           (0x1u<<20)

// FTSR1 Configuration

#define EXTI_FTSR1_FT21                 (0x1u<<21)
#define EXTI_FTSR1_FT20                 (0x1u<<20)
#define EXTI_FTSR1_FT16                 (0x1u<<16)
#define EXTI_FTSR1_FT15                 (0x1u<<15)
#define EXTI_FTSR1_FT14                 (0x1u<<14)
#define EXTI_FTSR1_FT13                 (0x1u<<13)
#define EXTI_FTSR1_FT12                 (0x1u<<12)
#define EXTI_FTSR1_FT11                 (0x1u<<11)
#define EXTI_FTSR1_FT10                 (0x1u<<10)
#define EXTI_FTSR1_FT9                  (0x1u<<9)
#define EXTI_FTSR1_FT8                  (0x1u<<8)
#define EXTI_FTSR1_FT7                  (0x1u<<7)
#define EXTI_FTSR1_FT6                  (0x1u<<6)
#define EXTI_FTSR1_FT5                  (0x1u<<5)
#define EXTI_FTSR1_FT4                  (0x1u<<4)
#define EXTI_FTSR1_FT3                  (0x1u<<3)
#define EXTI_FTSR1_FT2                  (0x1u<<2)
#define EXTI_FTSR1_FT1                  (0x1u<<1)
#define EXTI_FTSR1_FT0                  (0x1u<<0)

#define EXTI_FTSR1_FT21_B_0X0           (0x0u<<21)
#define EXTI_FTSR1_FT21_B_0X1           (0x1u<<21)
#define EXTI_FTSR1_FT20_B_0X0           (0x0u<<20)
#define EXTI_FTSR1_FT20_B_0X1           (0x1u<<20)

// SWIER1 Configuration

#define EXTI_SWIER1_SWI21               (0x1u<<21)
#define EXTI_SWIER1_SWI20               (0x1u<<20)
#define EXTI_SWIER1_SWI16               (0x1u<<16)
#define EXTI_SWIER1_SWI15               (0x1u<<15)
#define EXTI_SWIER1_SWI14               (0x1u<<14)
#define EXTI_SWIER1_SWI13               (0x1u<<13)
#define EXTI_SWIER1_SWI12               (0x1u<<12)
#define EXTI_SWIER1_SWI11               (0x1u<<11)
#define EXTI_SWIER1_SWI10               (0x1u<<10)
#define EXTI_SWIER1_SWI9                (0x1u<<9)
#define EXTI_SWIER1_SWI8                (0x1u<<8)
#define EXTI_SWIER1_SWI7                (0x1u<<7)
#define EXTI_SWIER1_SWI6                (0x1u<<6)
#define EXTI_SWIER1_SWI5                (0x1u<<5)
#define EXTI_SWIER1_SWI4                (0x1u<<4)
#define EXTI_SWIER1_SWI3                (0x1u<<3)
#define EXTI_SWIER1_SWI2                (0x1u<<2)
#define EXTI_SWIER1_SWI1                (0x1u<<1)
#define EXTI_SWIER1_SWI0                (0x1u<<0)

#define EXTI_SWIER1_SWI21_B_0X0         (0x0u<<21)
#define EXTI_SWIER1_SWI21_B_0X1         (0x1u<<21)
#define EXTI_SWIER1_SWI20_B_0X0         (0x0u<<20)
#define EXTI_SWIER1_SWI20_B_0X1         (0x1u<<20)

// RPR1 Configuration

