Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_exti.h
#define EXTI_FTSR2_FT57_B_0X0           (0x0u<<25)
#define EXTI_FTSR2_FT57_B_0X1           (0x1u<<25)

// SWIER2 Configuration

#define EXTI_SWIER2_SWI57               (0x1u<<25)
#define EXTI_SWIER2_SWI55               (0x1u<<23)
#define EXTI_SWIER2_SWI51               (0x1u<<19)

#define EXTI_SWIER2_SWI57_B_0X0         (0x0u<<25)
#define EXTI_SWIER2_SWI57_B_0X1         (0x1u<<25)

// RPR2 Configuration

#define EXTI_RPR2_RPIF57                (0x1u<<25)
#define EXTI_RPR2_RPIF55                (0x1u<<23)
#define EXTI_RPR2_RPIF51                (0x1u<<19)

#define EXTI_RPR2_RPIF57_B_0X0          (0x0u<<25)
#define EXTI_RPR2_RPIF57_B_0X1          (0x1u<<25)

// FPR2 Configuration

#define EXTI_FPR2_FPIF57                (0x1u<<25)
#define EXTI_FPR2_FPIF55                (0x1u<<23)
#define EXTI_FPR2_FPIF51                (0x1u<<19)

#define EXTI_FPR2_FPIF57_B_0X0          (0x0u<<25)
#define EXTI_FPR2_FPIF57_B_0X1          (0x1u<<25)

// SECCFGR2 Configuration

#define EXTI_SECCFGR2_SEC63             (0x1u<<31)
#define EXTI_SECCFGR2_SEC62             (0x1u<<30)
#define EXTI_SECCFGR2_SEC61             (0x1u<<29)
#define EXTI_SECCFGR2_SEC60             (0x1u<<28)
#define EXTI_SECCFGR2_SEC59             (0x1u<<27)
#define EXTI_SECCFGR2_SEC58             (0x1u<<26)
#define EXTI_SECCFGR2_SEC57             (0x1u<<25)
#define EXTI_SECCFGR2_SEC56             (0x1u<<24)
#define EXTI_SECCFGR2_SEC55             (0x1u<<23)
#define EXTI_SECCFGR2_SEC54             (0x1u<<22)
#define EXTI_SECCFGR2_SEC53             (0x1u<<21)
#define EXTI_SECCFGR2_SEC52             (0x1u<<20)
#define EXTI_SECCFGR2_SEC51             (0x1u<<19)
#define EXTI_SECCFGR2_SEC50             (0x1u<<18)
#define EXTI_SECCFGR2_SEC49             (0x1u<<17)
#define EXTI_SECCFGR2_SEC48             (0x1u<<16)
#define EXTI_SECCFGR2_SEC47             (0x1u<<15)
#define EXTI_SECCFGR2_SEC46             (0x1u<<14)
#define EXTI_SECCFGR2_SEC45             (0x1u<<13)
#define EXTI_SECCFGR2_SEC44             (0x1u<<12)
#define EXTI_SECCFGR2_SEC43             (0x1u<<11)
#define EXTI_SECCFGR2_SEC42             (0x1u<<10)
#define EXTI_SECCFGR2_SEC41             (0x1u<<9)
#define EXTI_SECCFGR2_SEC40             (0x1u<<8)
#define EXTI_SECCFGR2_SEC39             (0x1u<<7)
#define EXTI_SECCFGR2_SEC38             (0x1u<<6)
#define EXTI_SECCFGR2_SEC37             (0x1u<<5)
#define EXTI_SECCFGR2_SEC36             (0x1u<<4)
#define EXTI_SECCFGR2_SEC35             (0x1u<<3)
#define EXTI_SECCFGR2_SEC34             (0x1u<<2)
#define EXTI_SECCFGR2_SEC33             (0x1u<<1)
#define EXTI_SECCFGR2_SEC32             (0x1u<<0)

#define EXTI_SECCFGR2_SEC57_B_0X0       (0x0u<<25)
#define EXTI_SECCFGR2_SEC57_B_0X1       (0x1u<<25)

// PRIVCFGR2 Configuration

#define EXTI_PRIVCFGR2_PRIV63           (0x1u<<31)
#define EXTI_PRIVCFGR2_PRIV62           (0x1u<<30)
#define EXTI_PRIVCFGR2_PRIV61           (0x1u<<29)
#define EXTI_PRIVCFGR2_PRIV60           (0x1u<<28)
#define EXTI_PRIVCFGR2_PRIV59           (0x1u<<27)
#define EXTI_PRIVCFGR2_PRIV58           (0x1u<<26)
#define EXTI_PRIVCFGR2_PRIV57           (0x1u<<25)
#define EXTI_PRIVCFGR2_PRIV56           (0x1u<<24)
#define EXTI_PRIVCFGR2_PRIV55           (0x1u<<23)
#define EXTI_PRIVCFGR2_PRIV54           (0x1u<<22)
#define EXTI_PRIVCFGR2_PRIV53           (0x1u<<21)
#define EXTI_PRIVCFGR2_PRIV52           (0x1u<<20)
#define EXTI_PRIVCFGR2_PRIV51           (0x1u<<19)
#define EXTI_PRIVCFGR2_PRIV50           (0x1u<<18)
#define EXTI_PRIVCFGR2_PRIV49           (0x1u<<17)
#define EXTI_PRIVCFGR2_PRIV48           (0x1u<<16)
#define EXTI_PRIVCFGR2_PRIV47           (0x1u<<15)
#define EXTI_PRIVCFGR2_PRIV46           (0x1u<<14)
#define EXTI_PRIVCFGR2_PRIV45           (0x1u<<13)
#define EXTI_PRIVCFGR2_PRIV44           (0x1u<<12)
#define EXTI_PRIVCFGR2_PRIV43           (0x1u<<11)
#define EXTI_PRIVCFGR2_PRIV42           (0x1u<<10)
#define EXTI_PRIVCFGR2_PRIV41           (0x1u<<9)
#define EXTI_PRIVCFGR2_PRIV40           (0x1u<<8)
#define EXTI_PRIVCFGR2_PRIV39           (0x1u<<7)
#define EXTI_PRIVCFGR2_PRIV38           (0x1u<<6)
#define EXTI_PRIVCFGR2_PRIV37           (0x1u<<5)
#define EXTI_PRIVCFGR2_PRIV36           (0x1u<<4)
#define EXTI_PRIVCFGR2_PRIV35           (0x1u<<3)
#define EXTI_PRIVCFGR2_PRIV34           (0x1u<<2)
#define EXTI_PRIVCFGR2_PRIV33           (0x1u<<1)
#define EXTI_PRIVCFGR2_PRIV32           (0x1u<<0)

#define EXTI_PRIVCFGR2_PRIV57_B_0X0     (0x0u<<25)
#define EXTI_PRIVCFGR2_PRIV57_B_0X1     (0x1u<<25)

// SECCFGR3 Configuration

#define EXTI_SECCFGR3_SEC69             (0x1u<<5)
#define EXTI_SECCFGR3_SEC68             (0x1u<<4)
#define EXTI_SECCFGR3_SEC67             (0x1u<<3)
#define EXTI_SECCFGR3_SEC66             (0x1u<<2)
#define EXTI_SECCFGR3_SEC65             (0x1u<<1)
#define EXTI_SECCFGR3_SEC64             (0x1u<<0)

#define EXTI_SECCFGR3_SEC68_B_0X0       (0x0u<<4)
#define EXTI_SECCFGR3_SEC68_B_0X1       (0x1u<<4)

// PRIVCFGR3 Configuration

#define EXTI_PRIVCFGR3_PRIV69           (0x1u<<5)
#define EXTI_PRIVCFGR3_PRIV68           (0x1u<<4)
#define EXTI_PRIVCFGR3_PRIV67           (0x1u<<3)
#define EXTI_PRIVCFGR3_PRIV66           (0x1u<<2)
#define EXTI_PRIVCFGR3_PRIV65           (0x1u<<1)
#define EXTI_PRIVCFGR3_PRIV64           (0x1u<<0)

#define EXTI_PRIVCFGR3_PRIV68_B_0X0     (0x0u<<4)
#define EXTI_PRIVCFGR3_PRIV68_B_0X1     (0x1u<<4)

// EXTICR1 Configuration

#define EXTI_EXTICR1_EXTI3              (0xFFu<<24)
#define EXTI_EXTICR1_EXTI3_0            (0x1u<<24)
#define EXTI_EXTICR1_EXTI2              (0xFFu<<16)
#define EXTI_EXTICR1_EXTI2_0            (0x1u<<16)
#define EXTI_EXTICR1_EXTI1              (0xFFu<<8)
#define EXTI_EXTICR1_EXTI1_0            (0x1u<<8)
#define EXTI_EXTICR1_EXTI0              (0xFFu<<0)
#define EXTI_EXTICR1_EXTI0_0            (0x1u<<0)

#define EXTI_EXTICR1_EXTI3_B_0X00       (0x0u<<24)
#define EXTI_EXTICR1_EXTI3_B_0X01       (0x1u<<24)
#define EXTI_EXTICR1_EXTI3_B_0X02       (0x2u<<24)
#define EXTI_EXTICR1_EXTI3_B_0X03       (0x3u<<24)
#define EXTI_EXTICR1_EXTI3_B_0X04       (0x4u<<24)
#define EXTI_EXTICR1_EXTI3_B_0X05       (0x5u<<24)
#define EXTI_EXTICR1_EXTI3_B_0X06       (0x6u<<24)
#define EXTI_EXTICR1_EXTI3_B_0X07       (0x7u<<24)
#define EXTI_EXTICR1_EXTI3_B_0X08       (0x8u<<24)
#define EXTI_EXTICR1_EXTI3_B_0X09       (0x9u<<24)
#define EXTI_EXTICR1_EXTI3_B_0X0A       (0xAu<<24)
#define EXTI_EXTICR1_EXTI3_B_0X0B       (0xBu<<24)
#define EXTI_EXTICR1_EXTI2_B_0X00       (0x0u<<16)
#define EXTI_EXTICR1_EXTI2_B_0X01       (0x1u<<16)
#define EXTI_EXTICR1_EXTI2_B_0X02       (0x2u<<16)
#define EXTI_EXTICR1_EXTI2_B_0X03       (0x3u<<16)
#define EXTI_EXTICR1_EXTI2_B_0X04       (0x4u<<16)
#define EXTI_EXTICR1_EXTI2_B_0X05       (0x5u<<16)
#define EXTI_EXTICR1_EXTI2_B_0X06       (0x6u<<16)
#define EXTI_EXTICR1_EXTI2_B_0X07       (0x7u<<16)
#define EXTI_EXTICR1_EXTI2_B_0X08       (0x8u<<16)
#define EXTI_EXTICR1_EXTI2_B_0X09       (0x9u<<16)
#define EXTI_EXTICR1_EXTI2_B_0X0A       (0xAu<<16)
#define EXTI_EXTICR1_EXTI2_B_0X0B       (0xBu<<16)
#define EXTI_EXTICR1_EXTI1_B_0X00       (0x0u<<8)
#define EXTI_EXTICR1_EXTI1_B_0X01       (0x1u<<8)
#define EXTI_EXTICR1_EXTI1_B_0X02       (0x2u<<8)
#define EXTI_EXTICR1_EXTI1_B_0X03       (0x3u<<8)
#define EXTI_EXTICR1_EXTI1_B_0X04       (0x4u<<8)
#define EXTI_EXTICR1_EXTI1_B_0X05       (0x5u<<8)
#define EXTI_EXTICR1_EXTI1_B_0X06       (0x6u<<8)
#define EXTI_EXTICR1_EXTI1_B_0X07       (0x7u<<8)
#define EXTI_EXTICR1_EXTI1_B_0X08       (0x8u<<8)
#define EXTI_EXTICR1_EXTI1_B_0X09       (0x9u<<8)
#define EXTI_EXTICR1_EXTI1_B_0X0A       (0xAu<<8)
#define EXTI_EXTICR1_EXTI1_B_0X0B       (0xBu<<8)
#define EXTI_EXTICR1_EXTI0_B_0X00       (0x0u<<0)
#define EXTI_EXTICR1_EXTI0_B_0X01       (0x1u<<0)
#define EXTI_EXTICR1_EXTI0_B_0X02       (0x2u<<0)
#define EXTI_EXTICR1_EXTI0_B_0X03       (0x3u<<0)
#define EXTI_EXTICR1_EXTI0_B_0X04       (0x4u<<0)
#define EXTI_EXTICR1_EXTI0_B_0X05       (0x5u<<0)
#define EXTI_EXTICR1_EXTI0_B_0X06       (0x6u<<0)
#define EXTI_EXTICR1_EXTI0_B_0X07       (0x7u<<0)
#define EXTI_EXTICR1_EXTI0_B_0X08       (0x8u<<0)
#define EXTI_EXTICR1_EXTI0_B_0X09       (0x9u<<0)
#define EXTI_EXTICR1_EXTI0_B_0X0A       (0xAu<<0)
#define EXTI_EXTICR1_EXTI0_B_0X0B       (0xBu<<0)

// EXTICR2 Configuration

#define EXTI_EXTICR2_EXTI7              (0xFFu<<24)
#define EXTI_EXTICR2_EXTI7_0            (0x1u<<24)
#define EXTI_EXTICR2_EXTI6              (0xFFu<<16)
#define EXTI_EXTICR2_EXTI6_0            (0x1u<<16)
#define EXTI_EXTICR2_EXTI5              (0xFFu<<8)
#define EXTI_EXTICR2_EXTI5_0            (0x1u<<8)
#define EXTI_EXTICR2_EXTI4              (0xFFu<<0)
#define EXTI_EXTICR2_EXTI4_0            (0x1u<<0)

#define EXTI_EXTICR2_EXTI7_B_0X00       (0x0u<<24)
#define EXTI_EXTICR2_EXTI7_B_0X01       (0x1u<<24)
#define EXTI_EXTICR2_EXTI7_B_0X02       (0x2u<<24)
#define EXTI_EXTICR2_EXTI7_B_0X03       (0x3u<<24)
#define EXTI_EXTICR2_EXTI7_B_0X04       (0x4u<<24)
#define EXTI_EXTICR2_EXTI7_B_0X05       (0x5u<<24)
#define EXTI_EXTICR2_EXTI7_B_0X06       (0x6u<<24)
#define EXTI_EXTICR2_EXTI7_B_0X07       (0x7u<<24)
#define EXTI_EXTICR2_EXTI7_B_0X08       (0x8u<<24)
#define EXTI_EXTICR2_EXTI7_B_0X09       (0x9u<<24)
#define EXTI_EXTICR2_EXTI7_B_0X0A       (0xAu<<24)
#define EXTI_EXTICR2_EXTI7_B_0X0B       (0xBu<<24)
#define EXTI_EXTICR2_EXTI6_B_0X00       (0x0u<<16)
#define EXTI_EXTICR2_EXTI6_B_0X01       (0x1u<<16)
#define EXTI_EXTICR2_EXTI6_B_0X02       (0x2u<<16)
#define EXTI_EXTICR2_EXTI6_B_0X03       (0x3u<<16)
#define EXTI_EXTICR2_EXTI6_B_0X04       (0x4u<<16)
#define EXTI_EXTICR2_EXTI6_B_0X05       (0x5u<<16)
#define EXTI_EXTICR2_EXTI6_B_0X06       (0x6u<<16)
#define EXTI_EXTICR2_EXTI6_B_0X07       (0x7u<<16)
#define EXTI_EXTICR2_EXTI6_B_0X08       (0x8u<<16)
#define EXTI_EXTICR2_EXTI6_B_0X09       (0x9u<<16)
#define EXTI_EXTICR2_EXTI6_B_0X0A       (0xAu<<16)
#define EXTI_EXTICR2_EXTI6_B_0X0B       (0xBu<<16)
#define EXTI_EXTICR2_EXTI5_B_0X00       (0x0u<<8)
#define EXTI_EXTICR2_EXTI5_B_0X01       (0x1u<<8)
#define EXTI_EXTICR2_EXTI5_B_0X02       (0x2u<<8)
#define EXTI_EXTICR2_EXTI5_B_0X03       (0x3u<<8)
#define EXTI_EXTICR2_EXTI5_B_0X04       (0x4u<<8)
#define EXTI_EXTICR2_EXTI5_B_0X05       (0x5u<<8)
#define EXTI_EXTICR2_EXTI5_B_0X06       (0x6u<<8)
#define EXTI_EXTICR2_EXTI5_B_0X07       (0x7u<<8)
#define EXTI_EXTICR2_EXTI5_B_0X08       (0x8u<<8)
#define EXTI_EXTICR2_EXTI5_B_0X09       (0x9u<<8)
#define EXTI_EXTICR2_EXTI5_B_0X0A       (0xAu<<8)
#define EXTI_EXTICR2_EXTI5_B_0X0B       (0xBu<<8)
#define EXTI_EXTICR2_EXTI4_B_0X00       (0x0u<<0)
#define EXTI_EXTICR2_EXTI4_B_0X01       (0x1u<<0)
#define EXTI_EXTICR2_EXTI4_B_0X02       (0x2u<<0)
#define EXTI_EXTICR2_EXTI4_B_0X03       (0x3u<<0)
#define EXTI_EXTICR2_EXTI4_B_0X04       (0x4u<<0)
#define EXTI_EXTICR2_EXTI4_B_0X05       (0x5u<<0)
#define EXTI_EXTICR2_EXTI4_B_0X06       (0x6u<<0)
#define EXTI_EXTICR2_EXTI4_B_0X07       (0x7u<<0)
#define EXTI_EXTICR2_EXTI4_B_0X08       (0x8u<<0)
#define EXTI_EXTICR2_EXTI4_B_0X09       (0x9u<<0)
#define EXTI_EXTICR2_EXTI4_B_0X0A       (0xAu<<0)
#define EXTI_EXTICR2_EXTI4_B_0X0B       (0xBu<<0)

// EXTICR3 Configuration

