Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_exti.h
#define EXTI_EXTICR3_EXTI11             (0xFFu<<24)
#define EXTI_EXTICR3_EXTI11_0           (0x1u<<24)
#define EXTI_EXTICR3_EXTI10             (0xFFu<<16)
#define EXTI_EXTICR3_EXTI10_0           (0x1u<<16)
#define EXTI_EXTICR3_EXTI9              (0xFFu<<8)
#define EXTI_EXTICR3_EXTI9_0            (0x1u<<8)
#define EXTI_EXTICR3_EXTI8              (0xFFu<<0)
#define EXTI_EXTICR3_EXTI8_0            (0x1u<<0)

#define EXTI_EXTICR3_EXTI11_B_0X00      (0x0u<<24)
#define EXTI_EXTICR3_EXTI11_B_0X01      (0x1u<<24)
#define EXTI_EXTICR3_EXTI11_B_0X02      (0x2u<<24)
#define EXTI_EXTICR3_EXTI11_B_0X03      (0x3u<<24)
#define EXTI_EXTICR3_EXTI11_B_0X04      (0x4u<<24)
#define EXTI_EXTICR3_EXTI11_B_0X05      (0x5u<<24)
#define EXTI_EXTICR3_EXTI11_B_0X06      (0x6u<<24)
#define EXTI_EXTICR3_EXTI11_B_0X07      (0x7u<<24)
#define EXTI_EXTICR3_EXTI11_B_0X08      (0x8u<<24)
#define EXTI_EXTICR3_EXTI11_B_0X09      (0x9u<<24)
#define EXTI_EXTICR3_EXTI11_B_0X0A      (0xAu<<24)
#define EXTI_EXTICR3_EXTI11_B_0X0B      (0xBu<<24)
#define EXTI_EXTICR3_EXTI10_B_0X00      (0x0u<<16)
#define EXTI_EXTICR3_EXTI10_B_0X01      (0x1u<<16)
#define EXTI_EXTICR3_EXTI10_B_0X02      (0x2u<<16)
#define EXTI_EXTICR3_EXTI10_B_0X03      (0x3u<<16)
#define EXTI_EXTICR3_EXTI10_B_0X04      (0x4u<<16)
#define EXTI_EXTICR3_EXTI10_B_0X05      (0x5u<<16)
#define EXTI_EXTICR3_EXTI10_B_0X06      (0x6u<<16)
#define EXTI_EXTICR3_EXTI10_B_0X07      (0x7u<<16)
#define EXTI_EXTICR3_EXTI10_B_0X08      (0x8u<<16)
#define EXTI_EXTICR3_EXTI10_B_0X09      (0x9u<<16)
#define EXTI_EXTICR3_EXTI10_B_0X0A      (0xAu<<16)
#define EXTI_EXTICR3_EXTI10_B_0X0B      (0xBu<<16)
#define EXTI_EXTICR3_EXTI9_B_0X00       (0x0u<<8)
#define EXTI_EXTICR3_EXTI9_B_0X01       (0x1u<<8)
#define EXTI_EXTICR3_EXTI9_B_0X02       (0x2u<<8)
#define EXTI_EXTICR3_EXTI9_B_0X03       (0x3u<<8)
#define EXTI_EXTICR3_EXTI9_B_0X04       (0x4u<<8)
#define EXTI_EXTICR3_EXTI9_B_0X05       (0x5u<<8)
#define EXTI_EXTICR3_EXTI9_B_0X06       (0x6u<<8)
#define EXTI_EXTICR3_EXTI9_B_0X07       (0x7u<<8)
#define EXTI_EXTICR3_EXTI9_B_0X08       (0x8u<<8)
#define EXTI_EXTICR3_EXTI9_B_0X09       (0x9u<<8)
#define EXTI_EXTICR3_EXTI9_B_0X0A       (0xAu<<8)
#define EXTI_EXTICR3_EXTI9_B_0X0B       (0xBu<<8)
#define EXTI_EXTICR3_EXTI8_B_0X00       (0x0u<<0)
#define EXTI_EXTICR3_EXTI8_B_0X01       (0x1u<<0)
#define EXTI_EXTICR3_EXTI8_B_0X02       (0x2u<<0)
#define EXTI_EXTICR3_EXTI8_B_0X03       (0x3u<<0)
#define EXTI_EXTICR3_EXTI8_B_0X04       (0x4u<<0)
#define EXTI_EXTICR3_EXTI8_B_0X05       (0x5u<<0)
#define EXTI_EXTICR3_EXTI8_B_0X06       (0x6u<<0)
#define EXTI_EXTICR3_EXTI8_B_0X07       (0x7u<<0)
#define EXTI_EXTICR3_EXTI8_B_0X08       (0x8u<<0)
#define EXTI_EXTICR3_EXTI8_B_0X09       (0x9u<<0)
#define EXTI_EXTICR3_EXTI8_B_0X0A       (0xAu<<0)
#define EXTI_EXTICR3_EXTI8_B_0X0B       (0xBu<<0)

// EXTICR4 Configuration

#define EXTI_EXTICR4_EXTI15             (0xFFu<<24)
#define EXTI_EXTICR4_EXTI15_0           (0x1u<<24)
#define EXTI_EXTICR4_EXTI14             (0xFFu<<16)
#define EXTI_EXTICR4_EXTI14_0           (0x1u<<16)
#define EXTI_EXTICR4_EXTI13             (0xFFu<<8)
#define EXTI_EXTICR4_EXTI13_0           (0x1u<<8)
#define EXTI_EXTICR4_EXTI12             (0xFFu<<0)
#define EXTI_EXTICR4_EXTI12_0           (0x1u<<0)

#define EXTI_EXTICR4_EXTI15_B_0X00      (0x0u<<24)
#define EXTI_EXTICR4_EXTI15_B_0X01      (0x1u<<24)
#define EXTI_EXTICR4_EXTI15_B_0X02      (0x2u<<24)
#define EXTI_EXTICR4_EXTI15_B_0X03      (0x3u<<24)
#define EXTI_EXTICR4_EXTI15_B_0X04      (0x4u<<24)
#define EXTI_EXTICR4_EXTI15_B_0X05      (0x5u<<24)
#define EXTI_EXTICR4_EXTI15_B_0X06      (0x6u<<24)
#define EXTI_EXTICR4_EXTI15_B_0X07      (0x7u<<24)
#define EXTI_EXTICR4_EXTI15_B_0X09      (0x9u<<24)
#define EXTI_EXTICR4_EXTI15_B_0X0A      (0xAu<<24)
#define EXTI_EXTICR4_EXTI15_B_0X0B      (0xBu<<24)
#define EXTI_EXTICR4_EXTI14_B_0X00      (0x0u<<16)
#define EXTI_EXTICR4_EXTI14_B_0X01      (0x1u<<16)
#define EXTI_EXTICR4_EXTI14_B_0X02      (0x2u<<16)
#define EXTI_EXTICR4_EXTI14_B_0X03      (0x3u<<16)
#define EXTI_EXTICR4_EXTI14_B_0X04      (0x4u<<16)
#define EXTI_EXTICR4_EXTI14_B_0X05      (0x5u<<16)
#define EXTI_EXTICR4_EXTI14_B_0X06      (0x6u<<16)
#define EXTI_EXTICR4_EXTI14_B_0X07      (0x7u<<16)
#define EXTI_EXTICR4_EXTI14_B_0X09      (0x9u<<16)
#define EXTI_EXTICR4_EXTI14_B_0X0A      (0xAu<<16)
#define EXTI_EXTICR4_EXTI14_B_0X0B      (0xBu<<16)
#define EXTI_EXTICR4_EXTI13_B_0X00      (0x0u<<8)
#define EXTI_EXTICR4_EXTI13_B_0X01      (0x1u<<8)
#define EXTI_EXTICR4_EXTI13_B_0X02      (0x2u<<8)
#define EXTI_EXTICR4_EXTI13_B_0X03      (0x3u<<8)
#define EXTI_EXTICR4_EXTI13_B_0X04      (0x4u<<8)
#define EXTI_EXTICR4_EXTI13_B_0X05      (0x5u<<8)
#define EXTI_EXTICR4_EXTI13_B_0X06      (0x6u<<8)
#define EXTI_EXTICR4_EXTI13_B_0X07      (0x7u<<8)
#define EXTI_EXTICR4_EXTI13_B_0X09      (0x9u<<8)
#define EXTI_EXTICR4_EXTI13_B_0X0A      (0xAu<<8)
#define EXTI_EXTICR4_EXTI13_B_0X0B      (0xBu<<8)
#define EXTI_EXTICR4_EXTI12_B_0X00      (0x0u<<0)
#define EXTI_EXTICR4_EXTI12_B_0X01      (0x1u<<0)
#define EXTI_EXTICR4_EXTI12_B_0X02      (0x2u<<0)
#define EXTI_EXTICR4_EXTI12_B_0X03      (0x3u<<0)
#define EXTI_EXTICR4_EXTI12_B_0X04      (0x4u<<0)
#define EXTI_EXTICR4_EXTI12_B_0X05      (0x5u<<0)
#define EXTI_EXTICR4_EXTI12_B_0X06      (0x6u<<0)
#define EXTI_EXTICR4_EXTI12_B_0X07      (0x7u<<0)
#define EXTI_EXTICR4_EXTI12_B_0X09      (0x9u<<0)
#define EXTI_EXTICR4_EXTI12_B_0X0A      (0xAu<<0)
#define EXTI_EXTICR4_EXTI12_B_0X0B      (0xBu<<0)

// LOCKR Configuration

#define EXTI_LOCKR_LOCK                 (0x1u<<0)

#define EXTI_LOCKR_LOCK_B_0X0           (0x0u<<0)
#define EXTI_LOCKR_LOCK_B_0X1           (0x1u<<0)

// IMR1 Configuration

#define EXTI_IMR1_IM31                  (0x1u<<31)
#define EXTI_IMR1_IM30                  (0x1u<<30)
#define EXTI_IMR1_IM29                  (0x1u<<29)
#define EXTI_IMR1_IM28                  (0x1u<<28)
#define EXTI_IMR1_IM27                  (0x1u<<27)
#define EXTI_IMR1_IM26                  (0x1u<<26)
#define EXTI_IMR1_IM25                  (0x1u<<25)
#define EXTI_IMR1_IM24                  (0x1u<<24)
#define EXTI_IMR1_IM23                  (0x1u<<23)
#define EXTI_IMR1_IM22                  (0x1u<<22)
#define EXTI_IMR1_IM21                  (0x1u<<21)
#define EXTI_IMR1_IM20                  (0x1u<<20)
#define EXTI_IMR1_IM19                  (0x1u<<19)
#define EXTI_IMR1_IM18                  (0x1u<<18)
#define EXTI_IMR1_IM17                  (0x1u<<17)
#define EXTI_IMR1_IM16                  (0x1u<<16)
#define EXTI_IMR1_IM15                  (0x1u<<15)
#define EXTI_IMR1_IM14                  (0x1u<<14)
#define EXTI_IMR1_IM13                  (0x1u<<13)
#define EXTI_IMR1_IM12                  (0x1u<<12)
#define EXTI_IMR1_IM11                  (0x1u<<11)
#define EXTI_IMR1_IM10                  (0x1u<<10)
#define EXTI_IMR1_IM9                   (0x1u<<9)
#define EXTI_IMR1_IM8                   (0x1u<<8)
#define EXTI_IMR1_IM7                   (0x1u<<7)
#define EXTI_IMR1_IM6                   (0x1u<<6)
#define EXTI_IMR1_IM5                   (0x1u<<5)
#define EXTI_IMR1_IM4                   (0x1u<<4)
#define EXTI_IMR1_IM3                   (0x1u<<3)
#define EXTI_IMR1_IM2                   (0x1u<<2)
#define EXTI_IMR1_IM1                   (0x1u<<1)
#define EXTI_IMR1_IM0                   (0x1u<<0)

#define EXTI_IMR1_IM31_B_0X0            (0x0u<<31)
#define EXTI_IMR1_IM31_B_0X1            (0x1u<<31)
#define EXTI_IMR1_IM30_B_0X0            (0x0u<<30)
#define EXTI_IMR1_IM30_B_0X1            (0x1u<<30)
#define EXTI_IMR1_IM29_B_0X0            (0x0u<<29)
#define EXTI_IMR1_IM29_B_0X1            (0x1u<<29)
#define EXTI_IMR1_IM28_B_0X0            (0x0u<<28)
#define EXTI_IMR1_IM28_B_0X1            (0x1u<<28)
#define EXTI_IMR1_IM27_B_0X0            (0x0u<<27)
#define EXTI_IMR1_IM27_B_0X1            (0x1u<<27)
#define EXTI_IMR1_IM26_B_0X0            (0x0u<<26)
#define EXTI_IMR1_IM26_B_0X1            (0x1u<<26)
#define EXTI_IMR1_IM25_B_0X0            (0x0u<<25)
#define EXTI_IMR1_IM25_B_0X1            (0x1u<<25)
#define EXTI_IMR1_IM24_B_0X0            (0x0u<<24)
#define EXTI_IMR1_IM24_B_0X1            (0x1u<<24)
#define EXTI_IMR1_IM23_B_0X0            (0x0u<<23)
#define EXTI_IMR1_IM23_B_0X1            (0x1u<<23)
#define EXTI_IMR1_IM22_B_0X0            (0x0u<<22)
#define EXTI_IMR1_IM22_B_0X1            (0x1u<<22)
#define EXTI_IMR1_IM21_B_0X0            (0x0u<<21)
#define EXTI_IMR1_IM21_B_0X1            (0x1u<<21)
#define EXTI_IMR1_IM20_B_0X0            (0x0u<<20)
#define EXTI_IMR1_IM20_B_0X1            (0x1u<<20)
#define EXTI_IMR1_IM19_B_0X0            (0x0u<<19)
#define EXTI_IMR1_IM19_B_0X1            (0x1u<<19)
#define EXTI_IMR1_IM18_B_0X0            (0x0u<<18)
#define EXTI_IMR1_IM18_B_0X1            (0x1u<<18)
#define EXTI_IMR1_IM17_B_0X0            (0x0u<<17)
#define EXTI_IMR1_IM17_B_0X1            (0x1u<<17)
#define EXTI_IMR1_IM16_B_0X0            (0x0u<<16)
#define EXTI_IMR1_IM16_B_0X1            (0x1u<<16)
#define EXTI_IMR1_IM15_B_0X0            (0x0u<<15)
#define EXTI_IMR1_IM15_B_0X1            (0x1u<<15)
#define EXTI_IMR1_IM14_B_0X0            (0x0u<<14)
#define EXTI_IMR1_IM14_B_0X1            (0x1u<<14)
#define EXTI_IMR1_IM13_B_0X0            (0x0u<<13)
#define EXTI_IMR1_IM13_B_0X1            (0x1u<<13)
#define EXTI_IMR1_IM12_B_0X0            (0x0u<<12)
#define EXTI_IMR1_IM12_B_0X1            (0x1u<<12)
#define EXTI_IMR1_IM11_B_0X0            (0x0u<<11)
#define EXTI_IMR1_IM11_B_0X1            (0x1u<<11)
#define EXTI_IMR1_IM10_B_0X0            (0x0u<<10)
#define EXTI_IMR1_IM10_B_0X1            (0x1u<<10)
#define EXTI_IMR1_IM9_B_0X0             (0x0u<<9)
#define EXTI_IMR1_IM9_B_0X1             (0x1u<<9)
#define EXTI_IMR1_IM8_B_0X0             (0x0u<<8)
#define EXTI_IMR1_IM8_B_0X1             (0x1u<<8)
#define EXTI_IMR1_IM7_B_0X0             (0x0u<<7)
#define EXTI_IMR1_IM7_B_0X1             (0x1u<<7)
#define EXTI_IMR1_IM6_B_0X0             (0x0u<<6)
#define EXTI_IMR1_IM6_B_0X1             (0x1u<<6)
#define EXTI_IMR1_IM5_B_0X0             (0x0u<<5)
#define EXTI_IMR1_IM5_B_0X1             (0x1u<<5)
#define EXTI_IMR1_IM4_B_0X0             (0x0u<<4)
#define EXTI_IMR1_IM4_B_0X1             (0x1u<<4)
#define EXTI_IMR1_IM3_B_0X0             (0x0u<<3)
#define EXTI_IMR1_IM3_B_0X1             (0x1u<<3)
#define EXTI_IMR1_IM2_B_0X0             (0x0u<<2)
#define EXTI_IMR1_IM2_B_0X1             (0x1u<<2)
#define EXTI_IMR1_IM1_B_0X0             (0x0u<<1)
#define EXTI_IMR1_IM1_B_0X1             (0x1u<<1)
#define EXTI_IMR1_IM0_B_0X0             (0x0u<<0)
#define EXTI_IMR1_IM0_B_0X1             (0x1u<<0)

