Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_exti.h
// EMR1 Configuration

#define EXTI_EMR1_EM31                  (0x1u<<31)
#define EXTI_EMR1_EM30                  (0x1u<<30)
#define EXTI_EMR1_EM29                  (0x1u<<29)
#define EXTI_EMR1_EM28                  (0x1u<<28)
#define EXTI_EMR1_EM27                  (0x1u<<27)
#define EXTI_EMR1_EM26                  (0x1u<<26)
#define EXTI_EMR1_EM25                  (0x1u<<25)
#define EXTI_EMR1_EM24                  (0x1u<<24)
#define EXTI_EMR1_EM23                  (0x1u<<23)
#define EXTI_EMR1_EM22                  (0x1u<<22)
#define EXTI_EMR1_EM21                  (0x1u<<21)
#define EXTI_EMR1_EM20                  (0x1u<<20)
#define EXTI_EMR1_EM19                  (0x1u<<19)
#define EXTI_EMR1_EM18                  (0x1u<<18)
#define EXTI_EMR1_EM17                  (0x1u<<17)
#define EXTI_EMR1_EM16                  (0x1u<<16)
#define EXTI_EMR1_EM15                  (0x1u<<15)
#define EXTI_EMR1_EM14                  (0x1u<<14)
#define EXTI_EMR1_EM13                  (0x1u<<13)
#define EXTI_EMR1_EM12                  (0x1u<<12)
#define EXTI_EMR1_EM11                  (0x1u<<11)
#define EXTI_EMR1_EM10                  (0x1u<<10)
#define EXTI_EMR1_EM9                   (0x1u<<9)
#define EXTI_EMR1_EM8                   (0x1u<<8)
#define EXTI_EMR1_EM7                   (0x1u<<7)
#define EXTI_EMR1_EM6                   (0x1u<<6)
#define EXTI_EMR1_EM5                   (0x1u<<5)
#define EXTI_EMR1_EM4                   (0x1u<<4)
#define EXTI_EMR1_EM3                   (0x1u<<3)
#define EXTI_EMR1_EM2                   (0x1u<<2)
#define EXTI_EMR1_EM1                   (0x1u<<1)
#define EXTI_EMR1_EM0                   (0x1u<<0)

#define EXTI_EMR1_EM31_B_0X0            (0x0u<<31)
#define EXTI_EMR1_EM31_B_0X1            (0x1u<<31)
#define EXTI_EMR1_EM30_B_0X0            (0x0u<<30)
#define EXTI_EMR1_EM30_B_0X1            (0x1u<<30)
#define EXTI_EMR1_EM29_B_0X0            (0x0u<<29)
#define EXTI_EMR1_EM29_B_0X1            (0x1u<<29)
#define EXTI_EMR1_EM28_B_0X0            (0x0u<<28)
#define EXTI_EMR1_EM28_B_0X1            (0x1u<<28)
#define EXTI_EMR1_EM27_B_0X0            (0x0u<<27)
#define EXTI_EMR1_EM27_B_0X1            (0x1u<<27)
#define EXTI_EMR1_EM26_B_0X0            (0x0u<<26)
#define EXTI_EMR1_EM26_B_0X1            (0x1u<<26)
#define EXTI_EMR1_EM25_B_0X0            (0x0u<<25)
#define EXTI_EMR1_EM25_B_0X1            (0x1u<<25)
#define EXTI_EMR1_EM24_B_0X0            (0x0u<<24)
#define EXTI_EMR1_EM24_B_0X1            (0x1u<<24)
#define EXTI_EMR1_EM23_B_0X0            (0x0u<<23)
#define EXTI_EMR1_EM23_B_0X1            (0x1u<<23)
#define EXTI_EMR1_EM22_B_0X0            (0x0u<<22)
#define EXTI_EMR1_EM22_B_0X1            (0x1u<<22)
#define EXTI_EMR1_EM21_B_0X0            (0x0u<<21)
#define EXTI_EMR1_EM21_B_0X1            (0x1u<<21)
#define EXTI_EMR1_EM20_B_0X0            (0x0u<<20)
#define EXTI_EMR1_EM20_B_0X1            (0x1u<<20)
#define EXTI_EMR1_EM19_B_0X0            (0x0u<<19)
#define EXTI_EMR1_EM19_B_0X1            (0x1u<<19)
#define EXTI_EMR1_EM18_B_0X0            (0x0u<<18)
#define EXTI_EMR1_EM18_B_0X1            (0x1u<<18)
#define EXTI_EMR1_EM17_B_0X0            (0x0u<<17)
#define EXTI_EMR1_EM17_B_0X1            (0x1u<<17)
#define EXTI_EMR1_EM16_B_0X0            (0x0u<<16)
#define EXTI_EMR1_EM16_B_0X1            (0x1u<<16)
#define EXTI_EMR1_EM15_B_0X0            (0x0u<<15)
#define EXTI_EMR1_EM15_B_0X1            (0x1u<<15)
#define EXTI_EMR1_EM14_B_0X0            (0x0u<<14)
#define EXTI_EMR1_EM14_B_0X1            (0x1u<<14)
#define EXTI_EMR1_EM13_B_0X0            (0x0u<<13)
#define EXTI_EMR1_EM13_B_0X1            (0x1u<<13)
#define EXTI_EMR1_EM12_B_0X0            (0x0u<<12)
#define EXTI_EMR1_EM12_B_0X1            (0x1u<<12)
#define EXTI_EMR1_EM11_B_0X0            (0x0u<<11)
#define EXTI_EMR1_EM11_B_0X1            (0x1u<<11)
#define EXTI_EMR1_EM10_B_0X0            (0x0u<<10)
#define EXTI_EMR1_EM10_B_0X1            (0x1u<<10)
#define EXTI_EMR1_EM9_B_0X0             (0x0u<<9)
#define EXTI_EMR1_EM9_B_0X1             (0x1u<<9)
#define EXTI_EMR1_EM8_B_0X0             (0x0u<<8)
#define EXTI_EMR1_EM8_B_0X1             (0x1u<<8)
#define EXTI_EMR1_EM7_B_0X0             (0x0u<<7)
#define EXTI_EMR1_EM7_B_0X1             (0x1u<<7)
#define EXTI_EMR1_EM6_B_0X0             (0x0u<<6)
#define EXTI_EMR1_EM6_B_0X1             (0x1u<<6)
#define EXTI_EMR1_EM5_B_0X0             (0x0u<<5)
#define EXTI_EMR1_EM5_B_0X1             (0x1u<<5)
#define EXTI_EMR1_EM4_B_0X0             (0x0u<<4)
#define EXTI_EMR1_EM4_B_0X1             (0x1u<<4)
#define EXTI_EMR1_EM3_B_0X0             (0x0u<<3)
#define EXTI_EMR1_EM3_B_0X1             (0x1u<<3)
#define EXTI_EMR1_EM2_B_0X0             (0x0u<<2)
#define EXTI_EMR1_EM2_B_0X1             (0x1u<<2)
#define EXTI_EMR1_EM1_B_0X0             (0x0u<<1)
#define EXTI_EMR1_EM1_B_0X1             (0x1u<<1)
#define EXTI_EMR1_EM0_B_0X0             (0x0u<<0)
#define EXTI_EMR1_EM0_B_0X1             (0x1u<<0)

// IMR2 Configuration

#define EXTI_IMR2_IM63                  (0x1u<<31)
#define EXTI_IMR2_IM62                  (0x1u<<30)
#define EXTI_IMR2_IM61                  (0x1u<<29)
#define EXTI_IMR2_IM60                  (0x1u<<28)
#define EXTI_IMR2_IM59                  (0x1u<<27)
#define EXTI_IMR2_IM58                  (0x1u<<26)
#define EXTI_IMR2_IM57                  (0x1u<<25)
#define EXTI_IMR2_IM56                  (0x1u<<24)
#define EXTI_IMR2_IM55                  (0x1u<<23)
#define EXTI_IMR2_IM54                  (0x1u<<22)
#define EXTI_IMR2_IM53                  (0x1u<<21)
#define EXTI_IMR2_IM51                  (0x1u<<19)
#define EXTI_IMR2_IM49                  (0x1u<<17)
#define EXTI_IMR2_IM47                  (0x1u<<15)
#define EXTI_IMR2_IM46                  (0x1u<<14)
#define EXTI_IMR2_IM45                  (0x1u<<13)
#define EXTI_IMR2_IM44                  (0x1u<<12)
#define EXTI_IMR2_IM43                  (0x1u<<11)
#define EXTI_IMR2_IM42                  (0x1u<<10)
#define EXTI_IMR2_IM41                  (0x1u<<9)
#define EXTI_IMR2_IM40                  (0x1u<<8)
#define EXTI_IMR2_IM39                  (0x1u<<7)
#define EXTI_IMR2_IM38                  (0x1u<<6)
#define EXTI_IMR2_IM37                  (0x1u<<5)
#define EXTI_IMR2_IM36                  (0x1u<<4)
#define EXTI_IMR2_IM35                  (0x1u<<3)
#define EXTI_IMR2_IM34                  (0x1u<<2)
#define EXTI_IMR2_IM33                  (0x1u<<1)
#define EXTI_IMR2_IM32                  (0x1u<<0)

#define EXTI_IMR2_IM63_B_0X0            (0x0u<<31)
#define EXTI_IMR2_IM63_B_0X1            (0x1u<<31)
#define EXTI_IMR2_IM62_B_0X0            (0x0u<<30)
#define EXTI_IMR2_IM62_B_0X1            (0x1u<<30)
#define EXTI_IMR2_IM61_B_0X0            (0x0u<<29)
#define EXTI_IMR2_IM61_B_0X1            (0x1u<<29)
#define EXTI_IMR2_IM60_B_0X0            (0x0u<<28)
#define EXTI_IMR2_IM60_B_0X1            (0x1u<<28)
#define EXTI_IMR2_IM59_B_0X0            (0x0u<<27)
#define EXTI_IMR2_IM59_B_0X1            (0x1u<<27)
#define EXTI_IMR2_IM58_B_0X0            (0x0u<<26)
#define EXTI_IMR2_IM58_B_0X1            (0x1u<<26)
#define EXTI_IMR2_IM57_B_0X0            (0x0u<<25)
#define EXTI_IMR2_IM57_B_0X1            (0x1u<<25)
#define EXTI_IMR2_IM56_B_0X0            (0x0u<<24)
#define EXTI_IMR2_IM56_B_0X1            (0x1u<<24)
#define EXTI_IMR2_IM55_B_0X0            (0x0u<<23)
#define EXTI_IMR2_IM55_B_0X1            (0x1u<<23)
#define EXTI_IMR2_IM54_B_0X0            (0x0u<<22)
#define EXTI_IMR2_IM54_B_0X1            (0x1u<<22)
#define EXTI_IMR2_IM53_B_0X0            (0x0u<<21)
#define EXTI_IMR2_IM53_B_0X1            (0x1u<<21)

// EMR2 Configuration

#define EXTI_EMR2_EM63                  (0x1u<<31)
#define EXTI_EMR2_EM62                  (0x1u<<30)
#define EXTI_EMR2_EM61                  (0x1u<<29)
#define EXTI_EMR2_EM60                  (0x1u<<28)
#define EXTI_EMR2_EM59                  (0x1u<<27)
#define EXTI_EMR2_EM58                  (0x1u<<26)
#define EXTI_EMR2_EM57                  (0x1u<<25)
#define EXTI_EMR2_EM56                  (0x1u<<24)
#define EXTI_EMR2_EM55                  (0x1u<<23)
#define EXTI_EMR2_EM54                  (0x1u<<22)
#define EXTI_EMR2_EM53                  (0x1u<<21)
#define EXTI_EMR2_EM51                  (0x1u<<19)
#define EXTI_EMR2_EM49                  (0x1u<<17)
#define EXTI_EMR2_EM47                  (0x1u<<15)
#define EXTI_EMR2_EM46                  (0x1u<<14)
#define EXTI_EMR2_EM45                  (0x1u<<13)
#define EXTI_EMR2_EM44                  (0x1u<<12)
#define EXTI_EMR2_EM43                  (0x1u<<11)
#define EXTI_EMR2_EM42                  (0x1u<<10)
#define EXTI_EMR2_EM41                  (0x1u<<9)
#define EXTI_EMR2_EM40                  (0x1u<<8)
#define EXTI_EMR2_EM39                  (0x1u<<7)
#define EXTI_EMR2_EM38                  (0x1u<<6)
#define EXTI_EMR2_EM37                  (0x1u<<5)
#define EXTI_EMR2_EM36                  (0x1u<<4)
#define EXTI_EMR2_EM35                  (0x1u<<3)
#define EXTI_EMR2_EM34                  (0x1u<<2)
#define EXTI_EMR2_EM33                  (0x1u<<1)
#define EXTI_EMR2_EM32                  (0x1u<<0)

#define EXTI_EMR2_EM63_B_0X0            (0x0u<<31)
#define EXTI_EMR2_EM63_B_0X1            (0x1u<<31)
#define EXTI_EMR2_EM62_B_0X0            (0x0u<<30)
#define EXTI_EMR2_EM62_B_0X1            (0x1u<<30)
#define EXTI_EMR2_EM61_B_0X0            (0x0u<<29)
#define EXTI_EMR2_EM61_B_0X1            (0x1u<<29)
#define EXTI_EMR2_EM60_B_0X0            (0x0u<<28)
#define EXTI_EMR2_EM60_B_0X1            (0x1u<<28)
#define EXTI_EMR2_EM59_B_0X0            (0x0u<<27)
#define EXTI_EMR2_EM59_B_0X1            (0x1u<<27)
#define EXTI_EMR2_EM58_B_0X0            (0x0u<<26)
#define EXTI_EMR2_EM58_B_0X1            (0x1u<<26)
#define EXTI_EMR2_EM57_B_0X0            (0x0u<<25)
#define EXTI_EMR2_EM57_B_0X1            (0x1u<<25)
#define EXTI_EMR2_EM56_B_0X0            (0x0u<<24)
#define EXTI_EMR2_EM56_B_0X1            (0x1u<<24)
#define EXTI_EMR2_EM55_B_0X0            (0x0u<<23)
#define EXTI_EMR2_EM55_B_0X1            (0x1u<<23)
#define EXTI_EMR2_EM54_B_0X0            (0x0u<<22)
#define EXTI_EMR2_EM54_B_0X1            (0x1u<<22)
#define EXTI_EMR2_EM53_B_0X0            (0x0u<<21)
#define EXTI_EMR2_EM53_B_0X1            (0x1u<<21)
#define EXTI_EMR2_EM49_B_0X0            (0x0u<<17)
#define EXTI_EMR2_EM49_B_0X1            (0x1u<<17)
#define EXTI_EMR2_EM47_B_0X0            (0x0u<<15)
#define EXTI_EMR2_EM47_B_0X1            (0x1u<<15)
#define EXTI_EMR2_EM46_B_0X0            (0x0u<<14)
#define EXTI_EMR2_EM46_B_0X1            (0x1u<<14)
#define EXTI_EMR2_EM45_B_0X0            (0x0u<<13)
#define EXTI_EMR2_EM45_B_0X1            (0x1u<<13)
#define EXTI_EMR2_EM44_B_0X0            (0x0u<<12)
#define EXTI_EMR2_EM44_B_0X1            (0x1u<<12)
#define EXTI_EMR2_EM43_B_0X0            (0x0u<<11)
#define EXTI_EMR2_EM43_B_0X1            (0x1u<<11)
#define EXTI_EMR2_EM42_B_0X0            (0x0u<<10)
#define EXTI_EMR2_EM42_B_0X1            (0x1u<<10)
#define EXTI_EMR2_EM41_B_0X0            (0x0u<<9)
#define EXTI_EMR2_EM41_B_0X1            (0x1u<<9)
#define EXTI_EMR2_EM40_B_0X0            (0x0u<<8)
#define EXTI_EMR2_EM40_B_0X1            (0x1u<<8)
#define EXTI_EMR2_EM39_B_0X0            (0x0u<<7)
#define EXTI_EMR2_EM39_B_0X1            (0x1u<<7)
#define EXTI_EMR2_EM38_B_0X0            (0x0u<<6)
#define EXTI_EMR2_EM38_B_0X1            (0x1u<<6)
#define EXTI_EMR2_EM37_B_0X0            (0x0u<<5)
#define EXTI_EMR2_EM37_B_0X1            (0x1u<<5)
#define EXTI_EMR2_EM36_B_0X0            (0x0u<<4)
#define EXTI_EMR2_EM36_B_0X1            (0x1u<<4)
#define EXTI_EMR2_EM35_B_0X0            (0x0u<<3)
#define EXTI_EMR2_EM35_B_0X1            (0x1u<<3)
#define EXTI_EMR2_EM34_B_0X0            (0x0u<<2)
#define EXTI_EMR2_EM34_B_0X1            (0x1u<<2)
#define EXTI_EMR2_EM33_B_0X0            (0x0u<<1)
#define EXTI_EMR2_EM33_B_0X1            (0x1u<<1)
#define EXTI_EMR2_EM32_B_0X0            (0x0u<<0)
#define EXTI_EMR2_EM32_B_0X1            (0x1u<<0)

// IMR3 Configuration

