Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_exti.h
#define EXTI_IMR3_IM69                  (0x1u<<5)
#define EXTI_IMR3_IM68                  (0x1u<<4)
#define EXTI_IMR3_IM67                  (0x1u<<3)
#define EXTI_IMR3_IM66                  (0x1u<<2)
#define EXTI_IMR3_IM65                  (0x1u<<1)
#define EXTI_IMR3_IM64                  (0x1u<<0)

#define EXTI_IMR3_IM69_B_0X0            (0x0u<<5)
#define EXTI_IMR3_IM69_B_0X1            (0x1u<<5)
#define EXTI_IMR3_IM68_B_0X0            (0x0u<<4)
#define EXTI_IMR3_IM68_B_0X1            (0x1u<<4)
#define EXTI_IMR3_IM67_B_0X0            (0x0u<<3)
#define EXTI_IMR3_IM67_B_0X1            (0x1u<<3)
#define EXTI_IMR3_IM66_B_0X0            (0x0u<<2)
#define EXTI_IMR3_IM66_B_0X1            (0x1u<<2)
#define EXTI_IMR3_IM65_B_0X0            (0x0u<<1)
#define EXTI_IMR3_IM65_B_0X1            (0x1u<<1)
#define EXTI_IMR3_IM64_B_0X0            (0x0u<<0)
#define EXTI_IMR3_IM64_B_0X1            (0x1u<<0)

// EMR3 Configuration

#define EXTI_EMR3_EM69                  (0x1u<<5)
#define EXTI_EMR3_EM68                  (0x1u<<4)
#define EXTI_EMR3_EM67                  (0x1u<<3)
#define EXTI_EMR3_EM66                  (0x1u<<2)
#define EXTI_EMR3_EM65                  (0x1u<<1)
#define EXTI_EMR3_EM64                  (0x1u<<0)

#define EXTI_EMR3_EM69_B_0X0            (0x0u<<5)
#define EXTI_EMR3_EM69_B_0X1            (0x1u<<5)
#define EXTI_EMR3_EM68_B_0X0            (0x0u<<4)
#define EXTI_EMR3_EM68_B_0X1            (0x1u<<4)
#define EXTI_EMR3_EM67_B_0X0            (0x0u<<3)
#define EXTI_EMR3_EM67_B_0X1            (0x1u<<3)
#define EXTI_EMR3_EM66_B_0X0            (0x0u<<2)
#define EXTI_EMR3_EM66_B_0X1            (0x1u<<2)
#define EXTI_EMR3_EM65_B_0X0            (0x0u<<1)
#define EXTI_EMR3_EM65_B_0X1            (0x1u<<1)
#define EXTI_EMR3_EM64_B_0X0            (0x0u<<0)
#define EXTI_EMR3_EM64_B_0X1            (0x1u<<0)
